# RepeatingDetailInside Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RepeatingDetailInside Property
ParameterTypeId Class See Also
---
"Inside"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RepeatingDetailInside { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RepeatingDetailInside As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RepeatingDetailInside {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace